

item_leather_head = {

    'id': '',
    'lvl': 1,
    'type': 'armor',
    'slot': 'head',
    'name': 'Кожаный шлем',
    'slash_dmg': 1,
    'blunt_dmg': 1,
    'piercing_dmg': 0,
    'mental_dmg': 4,
    'durability': 10,
    'description': {
        '0': 'Это можно надеть...',
        '5': 'Кожаный шлем. Вроде неплохо защищает.',
        '10': 'Кожаный шлем низкого качества. Защищает не слишком хорошо.',
        '15': 'Кожаный шлем. Немного защищает от дробящего и рубящего урона, но бесполезен для колющего.'
    }

}


item_leather_belts = {

    'id': '',
    'lvl': 1,
    'type': 'armor',
    'slot': 'body',
    'name': 'Кожаные ремни',
    'slash_dmg': 1,
    'blunt_dmg': 1,
    'piercing_dmg': 0,
    'mental_dmg': 5,
    'durability': 15,
    'description': {
        '0': 'Это можно надеть...',
        '5': 'Кожаный шлем. Вроде неплохо защищает.',
        '10': 'Кожаный шлем низкого качества. Защищает не слишком хорошо.',
        '15': 'Кожаный шлем. Немного защищает от дробящего и рубящего урона, но бесполезен для колющего.'
    }
}


item_example = {

    'id': '',
    'lvl': 1,
    'type': '',
    'slot': '',
    'name': '',
    'slash_dmg': 0,
    'blunt_dmg': 0,
    'piercing_dmg': 0,
    'mental_dmg': 0,
    'durability': 0,
    'description': {
        '0': '',
        '5': '.',
        '10': '',
        '15': ''
    }
}

